/*****************************************************************************
 * NewProject.c
 *****************************************************************************/

#include "l502_cdefs.h"
void l502_init(void);
#include "l502_global.h"
#include "l502_cmd.h"

void stream_proc(void);

/* g_state описывает область пам€ти, расположенную по фиксированным адресам.
 * ƒл€ расположени€ в начало банка A данных используем специальную секцию */
SECTION("board_state", volatile t_l502_board_state g_state);


int main(void) {
    /* »нициализаци€ интерфейсов */
    l502_init();


    for (;;) {
        /* провер€ем наличие команды от ѕ  и начина€ем
           обработку, если она есть */
        l502_cmd_check_req();
        /* обработка потоков данных */
        stream_proc();
    }
    return 0;
}
